package accountbook;

public class AccountBookTest {

	public static void main(String[] args) {
		/* 가계부 프로그램 구현하려고 한다. 이때 필요한 클래스를 만들어보세요.
		 * 지출 입금 잔액 지출타입?(식비 등등...)// 고정지출 저번달 지출비교(메소드??) 
		 * 수입 : 수입/지출				< int로 받아서 계속 더하기(각각 수입따로 보여주나? 아님 총액?)
		 * 날짜 :						< 이것도 입력받아서 그대로... 변경사항없음
		 * 자산 : 현금/ 은행/ 카드/		< 자산은 문자열 타입.. 각각 변수선언하고 숫자로 선택해서 리턴하게..? 스위치문?
		 * 분류 : 식비/ 교통/ 건강/ 		< 위랑 비슷? 뭔가 배열써야할거같은데
		 * 금액 : 					< int로 받아서 어딘가에 저장해둬야할거같음
		 * 내용 : 					< 문자열
		 * */ 
		plus ex1 = new plus();
		
		

	}

}



