package mynote;

public class day2 {

	public static void main(String[] args) {
		/*요약
		 * <증감연산자 : 숫자>
		 * 최종적으로 1증가 1감소
		 * 전위형 후위형에 상관없이 연산이 끝난 다음에 변수의 값이 1 증가/감소
		 * 전위혐 ++변수명 증가하고 동작
		 * 후위형 변수명++ 동작하고 증가
		 * 
		 * <산술연산자 : 숫자>
		 * /: 정수/정수=> 정수(소수점이 사라짐)
		 * 타입변환을 통해 정수/정수를 실수.정수로 변환 후 계산
		 * %: 나누었을때 나머지가~로 표현되면 사용
		 * 
		 * <비교연산자 : 참 또는 거짓>
		 * 크기 비교
		 * 
		 * <논리연산자 : 참 또는 거짓>
		 * &&: ~하고, and
		 * ||:~하거나, or
		 * ! : 반대, 참이면 거짓, 거짓이면 참
		 * 
		 * <조건선택연산자 : 알 수 없음(숫자, 참, 또는 거짓 모두 가능)>
		 * 
		 * 
		 * */

	}

}
